
&НаКлиенте
Процедура ТестТокена(Команда)
	 РезультатТеста = ТестТокенаНаСервере();
     
	Если НЕ ТипЗнч(РезультатТеста) = Тип("Соответствие") Тогда    
		Сообщить(РезультатТеста);
		Журнал.ДобавитьСтроку(СтрШаблон("Тест не выполнен: %1", РезультатТеста));
        Возврат;
    КонецЕсли;
     
    ТестВыполнен = РезультатТеста["ok"];   
	                          	Сообщить(РезультатТеста);

Журнал.ДобавитьСтроку(СтрШаблон("Тест выполнен: %1", ТестВыполнен));     


     
    Если НЕ ТестВыполнен Тогда
        Возврат;
    КонецЕсли;
     
    Для каждого ЭлементРезультата Из РезультатТеста["result"] Цикл
         
        СтрокаРезультата = СтрШаблон("%1 : %2", ЭлементРезультата.Ключ, ЭлементРезультата.Значение);
		Журнал.ДобавитьСтроку(СтрокаРезультата);
         
    КонецЦикла;

КонецПроцедуры

&НаСервереБезКонтекста
Функция ТестТокенаНаСервере()
	 Результат = Неопределено;
     
    АдресURL = СтрШаблон("https://api.telegram.org/bot%1/getMe", Константы.Токен.Получить());
     
    Попытка
        Результат = КоннекторHTTP.GetJson(АдресURL);    
    Исключение
        Результат = ОписаниеОшибки();
    КонецПопытки;
     
    Возврат Результат;

КонецФункции
